<?php

/**
 * 示例：0x00001
 */
return [
    'system'   => [
        'x00001' => '系统发生错误，请联系管理员，QQ：292304400，gmail：linlm1994@gmail.com',
        'x00002' => '操作失败，数据不存在或已被删除',
        'x00003' => '操作失败，请不要重复操作',
        'x00004' => '操作失败，必填信息不得为空',
    ],
    'article'  => [
        'x00001' => '操作失败，文章不存在或已经被删除',
        'x00002' => '新增失败，文章必填内容不得为空',
        'x00003' => '操作失败，请不要重复操作',
        'x00004' => '操作失败，评论不存在或已经被删除',
        'x00005' => '操作失败，文章不存在或已经被删除',
    ],
    'login'    => [
        'x00001' => '登录失败，登录信息不得为空',
        'x00002' => '登录失败，账号或密码不正确',
    ],
    'register' => [
        'x00001' => '注册失败，注册必填信息不得为空',
        'x00002' => '注册失败，用户名已被使用',
        'x00003' => '注册失败，邮箱已被使用',
        'x00004' => '激活失败，邮件已经失效',
    ],
    'user' => [
        'x00001' => '更新失败，用户名已被使用',
    ],
    'admin' => [
        'x00001' => '更新失败，账号已被使用',
        'x00002' => '更新失败，邮箱已被使用',
    ],
    'leave' => [
        'x00001' => '回复失败，不存在这条留言',
    ]
];
